Slatye/PX4Firmware/src/drivers/stm32/drv_hrt.c
/** Number of same-sized frames required to 'lock' */
#define PPM_CHANNEL_LOCK	4		/**< should be less than the input timeout */

__EXPORT uint16_t ppm_buffer[PPM_MAX_CHANNELS];
__EXPORT uint16_t ppm_frame_length = 0;
__EXPORT unsigned ppm_decoded_channels = 0;
__EXPORT uint64_t ppm_last_valid_decode = 0;

/* PPM edge history */
__EXPORT uint16_t ppm_edge_history[32];
unsigned ppm_edge_next;

/* PPM pulse history */
__EXPORT uint16_t ppm_pulse_history[32];
unsigned ppm_pulse_next;

static uint16_t ppm_temp_buffer[PPM_MAX_CHANNELS];

/** PPM decoder state machine */
struct {
	uint16_t	last_edge;	/**< last capture time */
	uint16_t	last_mark;	/**< last significant edge */
	uint16_t	frame_start;	/**< the frame width */
	unsigned	next_channel;	/**< next channel index */
	enum {
		UNSYNCH = 0,
		ARM,
		ACTIVE,
		INACTIVE
	} phase;
} ppm;

static void	hrt_ppm_decode(uint32_t status);

#else
/* disable the PPM configuration */
# define rCCR_PPM	0
# define DIER_PPM	0
# define SR_INT_PPM	0
# define SR_OVF_PPM	0
# define CCMR1_PPM	0
# define CCMR2_PPM	0
# define CCER_PPM	0
#endif /* HRT_PPM_CHANNEL */


#ifdef HRT_PWM_CHANNEL
/* 
 * If the timer hardware doesn't support GTIM_CCER_CCxNP, then we will work around it.
 *
 * Note that we assume that M3 means STM32F1 (since we don't really care about the F2).
 */

# ifdef CONFIG_ARCH_CORTEXM3
#  undef GTIM_CCER_CC1NP
#  undef GTIM_CCER_CC2NP
#  undef GTIM_CCER_CC3NP
#  undef GTIM_CCER_CC4NP
#  define GTIM_CCER_CC1NP 0
#  define GTIM_CCER_CC2NP 0
#  define GTIM_CCER_CC3NP 0
#  define GTIM_CCER_CC4NP 0
# endif

# if HRT_PWM_CHANNEL == 1
#  define rCCR_PWM	        rCCR1			/* capture register for PPM */
#  define DIER_PWM	        GTIM_DIER_CC1IE		/* capture interrupt (non-DMA mode) */
#  define SR_INT_PWM	    GTIM_SR_CC1IF		/* capture interrupt (non-DMA mode) */
#  define SR_OVF_PWM	    GTIM_SR_CC1OF		/* capture overflow (non-DMA mode) */
#  define CCMR1_PWM	        1			/* not on TI1/TI2 */
#  define CCMR2_PWM	        0			/* on TI3, not on TI4 */
#  define CCER_PWM	        (GTIM_CCER_CC1E | GTIM_CCER_CC1P | GTIM_CCER_CC1NP) /* CC1, both edges */
#  define CCER_PWM_POSEDGE  0
#  define CCER_PWM_NEGEDGE  (GTIM_CCER_CC1P)
#  define CCER_PWM_EDGE     (GTIM_CCER_CC1P | GTIM_CCER_CC1NP)
# elif HRT_PWM_CHANNEL == 2
#  define rCCR_PWM	        rCCR2			/* capture register for PPM */
#  define DIER_PWM	        GTIM_DIER_CC2IE		/* capture interrupt (non-DMA mode) */
#  define SR_INT_PWM	    GTIM_SR_CC2IF		/* capture interrupt (non-DMA mode) */
#  define SR_OVF_PWM	    GTIM_SR_CC2OF		/* capture overflow (non-DMA mode) */
#  define CCMR1_PWM	        2			/* not on TI1/TI2 */
#  define CCMR2_PWM	        0			/* on TI3, not on TI4 */
#  define CCER_PWM	        (GTIM_CCER_CC2E | GTIM_CCER_CC2P | GTIM_CCER_CC2NP) /* CC2, both edges */
#  define CCER_PWM_POSEDGE  0
#  define CCER_PWM_NEGEDGE  (GTIM_CCER_CC2P)
#  define CCER_PWM_EDGE     (GTIM_CCER_CC2P | GTIM_CCER_CC2NP)
# elif HRT_PWM_CHANNEL == 3
#  define rCCR_PWM	        rCCR3			/* capture register for PPM */
#  define DIER_PWM	        GTIM_DIER_CC3IE		/* capture interrupt (non-DMA mode) */
#  define SR_INT_PWM	    GTIM_SR_CC3IF		/* capture interrupt (non-DMA mode) */
#  define SR_OVF_PWM	    GTIM_SR_CC3OF		/* capture overflow (non-DMA mode) */
#  define CCMR1_PWM	        0			/* not on TI1/TI2 */
#  define CCMR2_PWM	        1			/* on TI3, not on TI4 */
#  define CCER_PWM	        (GTIM_CCER_CC3E | GTIM_CCER_CC3P | GTIM_CCER_CC3NP) /* CC3, both edges */
#  define CCER_PWM_POSEDGE  0
#  define CCER_PWM_NEGEDGE  (GTIM_CCER_CC3P)
#  define CCER_PWM_EDGE     (GTIM_CCER_CC3P | GTIM_CCER_CC3NP)
# elif HRT_WWM_CHANNEL == 4
#  define rCCR_PWM	        rCCR4			/* capture register for PPM */
#  define DIER_PWM	        GTIM_DIER_CC4IE		/* capture interrupt (non-DMA mode) */
#  define SR_INT_PWM	    GTIM_SR_CC4IF		/* capture interrupt (non-DMA mode) */
#  define SR_OVF_PWM	    GTIM_SR_CC4OF		/* capture overflow (non-DMA mode) */
#  define CCMR1_PWM	        0			/* not on TI1/TI2 */
#  define CCMR2_PWM	        2			/* on TI3, not on TI4 */
#  define CCER_PWM	        (GTIM_CCER_CC4E | GTIM_CCER_CC4P | GTIM_CCER_CC4NP) /* CC4, both edges */
#  define CCER_PWM_POSEDGE  0
#  define CCER_PWM_NEGEDGE  (GTIM_CCER_CC4P)
#  define CCER_PWM_EDGE     (GTIM_CCER_CC4P | GTIM_CCER_CC4NP)
# else
#  error HRT_PWM_CHANNEL must be a value between 1 and 4
# endif

#define PWM_MAX_PERIOD 5000
#define PWM_MIN_PERIOD 0

__EXPORT uint16_t pwm_buffer_width = 0;
__EXPORT uint16_t pwm_buffer_period = 0;
__EXPORT uint64_t pwm_last_valid_decode = 0;

/* PWM decoder state machine */
struct {
	uint16_t	last_posedge;	/* last positive edge time */
	uint16_t	last_negedge;	/* last negative edge */
	uint16_t	width; // Width of the pulse (need to store until we get the period as well)
    uint64_t    error_count;
} pwm;

static void	hrt_pwm_decode(uint32_t status, uint8_t edge);

#include <uORB/uORB.h>
#include <uORB/topics/pwm_input.h>
#include <uORB/topics/subsystem_info.h>
orb_advert_t _pwm_pub = -1;


#else
/* disable the PPM configuration */
# define rCCR_PWM	0
# define DIER_PWM	0
# define SR_INT_PWM	0
# define SR_OVF_PWM	0
# define CCMR1_PWM	0
# define CCMR2_PWM	0
# define CCER_PWM	0
#endif /* HRT_PWM_CHANNEL */

/*
 * Initialise the timer we are going to use.
 *
 * We expect that we'll own one of the reduced-function STM32 general
 * timers, and that we can use channel 1 in compare mode.
 */
static void
hrt_tim_init(void)
{
	/* claim our interrupt vector */
	irq_attach(HRT_TIMER_VECTOR, hrt_tim_isr);

	/* clock/power on our timer */
	modifyreg32(HRT_TIMER_POWER_REG, 0, HRT_TIMER_POWER_BIT);

	/* disable and configure the timer */
	rCR1 = 0;
	rCR2 = 0;
	rSMCR = 0;
	rDIER = DIER_HRT | DIER_PPM;
	rCCER = 0;		/* unlock CCMR* registers */
	rCCMR1 = CCMR1_PPM;
	rCCMR2 = CCMR2_PPM;
	rCCER = CCER_PPM;
	rDCR = 0;

	/* configure the timer to free-run at 1MHz */
	rPSC = (HRT_TIMER_CLOCK / 1000000) - 1;	/* this really only works for whole-MHz clocks */

	/* run the full span of the counter */
	rARR = 0xffff;

	/* set an initial capture a little ways off */
	rCCR_HRT = 1000;

	/* generate an update event; reloads the counter, all registers */
	rEGR = GTIM_EGR_UG;

	/* enable the timer */
	rCR1 = GTIM_CR1_CEN;

	/* enable interrupts */
	up_enable_irq(HRT_TIMER_VECTOR);
}

#ifdef HRT_PPM_CHANNEL
/**
 * Handle the PPM decoder state machine.
 */
static void
hrt_ppm_decode(uint32_t status)
{
	uint16_t count = rCCR_PPM;
	uint16_t width;
	uint16_t interval;
	unsigned i;

	/* if we missed an edge, we have to give up */
	if (status & SR_OVF_PPM)
		goto error;

	/* how long since the last edge? - this handles counter wrapping implicitely. */
	width = count - ppm.last_edge;

